#### Terraform Plan 📖`success`

<details><summary>Show staging Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
random_password.password: Refreshing state... [id=none]
time_rotating.rotate: Refreshing state... [id=2021-11-17T10:30:53Z]
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01]
azurerm_availability_set.availability: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Compute/availabilitySets/aset-neolutin-01]
module.vm1.azurerm_public_ip.pip: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/publicIPAddresses/pip-vm1-staging-neolutin-01]
azurerm_virtual_network.main: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/virtualNetworks/vnet-neolutin-01]
azurerm_network_security_group.vault: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkSecurityGroups/nsg-neolutin-01]
azurerm_subnet.internal: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/virtualNetworks/vnet-neolutin-01/subnets/internal]
azuread_application.ansible_app: Refreshing state... [id=79d30ea6-c87d-4697-ad49-2a0716098090]
module.vm1.azurerm_network_interface.main: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkInterfaces/nic1-vm1-staging-neolutin-01]
module.vm1.azurerm_network_interface.internal: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkInterfaces/nic2-vm1-staging-neolutin-01]
module.vm1.azurerm_network_interface_security_group_association.main: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkInterfaces/nic2-vm1-staging-neolutin-01|/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkSecurityGroups/nsg-neolutin-01]
azuread_service_principal.ansible_sp: Refreshing state... [id=0c97454c-9699-4426-80ce-202c2810af84]
azuread_application_password.ansible_app_pass: Refreshing state... [id=79d30ea6-c87d-4697-ad49-2a0716098090/password/9a756eb6-3d0e-4964-bc9e-de663cad6067]
azurerm_key_vault.main_kv: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.KeyVault/vaults/kv-staging-neolutin-01]
azurerm_key_vault_secret.simple_user_password: Refreshing state... [id=https://kv-staging-neolutin-01.vault.azure.net/secrets/simplepassword/f2d5a07b6c2147e28fdb016f54e9c467]
azurerm_role_assignment.ansible_ra: Refreshing state... [id=/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.KeyVault/vaults/kv-staging-neolutin-01/providers/Microsoft.Authorization/roleAssignments/2e494030-272b-6d5f-9692-7a32e244f955]
azurerm_key_vault_key.vaultkey: Refreshing state... [id=https://kv-staging-neolutin-01.vault.azure.net/keys/vaultkey/3985f5f210c341e28b845f7cc479ab57]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vm1.azurerm_public_ip.pip has been changed
  ~ resource "azurerm_public_ip" "pip" {
        id                      = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/publicIPAddresses/pip-vm1-staging-neolutin-01"
      - ip_address              = "40.68.58.211" -> null
        name                    = "pip-vm1-staging-neolutin-01"
        tags                    = {
            "Terraform" = "true"
        }
        # (12 unchanged attributes hidden)
    }
  # module.vm1.azurerm_network_interface.internal has been changed
  ~ resource "azurerm_network_interface" "internal" {
        id                            = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkInterfaces/nic2-vm1-staging-neolutin-01"
      - internal_domain_name_suffix   = "tg0jspjos0mu5eqjarwjcvi0ka.ax.internal.cloudapp.net" -> null
        name                          = "nic2-vm1-staging-neolutin-01"
        tags                          = {
            "Terraform" = "true"
        }
      - virtual_machine_id            = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Compute/virtualMachines/vm1-staging-neolutin-01" -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.vm1.azurerm_network_interface.main has been changed
  ~ resource "azurerm_network_interface" "main" {
        id                            = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkInterfaces/nic1-vm1-staging-neolutin-01"
      - internal_domain_name_suffix   = "tg0jspjos0mu5eqjarwjcvi0ka.ax.internal.cloudapp.net" -> null
        name                          = "nic1-vm1-staging-neolutin-01"
        tags                          = {
            "Terraform" = "true"
        }
      - virtual_machine_id            = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Compute/virtualMachines/vm1-staging-neolutin-01" -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vm1.azurerm_linux_virtual_machine.main will be created
  + resource "azurerm_linux_virtual_machine" "main" {
      + admin_username                  = "adminuser"
      + allow_extension_operations      = true
      + availability_set_id             = "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Compute/availabilitySets/aset-neolutin-01"
      + computer_name                   = (known after apply)
      + disable_password_authentication = true
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "westeurope"
      + max_bid_price                   = -1
      + name                            = "vm1-staging-neolutin-01"
      + network_interface_ids           = [
          + "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkInterfaces/nic1-vm1-staging-neolutin-01",
          + "/subscriptions/5c180a01-6ade-4df8-9833-5cf9f4f3b969/resourceGroups/rg-staging-neolutin-01/providers/Microsoft.Network/networkInterfaces/nic2-vm1-staging-neolutin-01",
        ]
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "rg-staging-neolutin-01"
      + size                            = "Standard_A1_v2"
      + tags                            = {
          + "Terraform" = "true"
        }
      + virtual_machine_id              = (known after apply)
      + zone                            = (known after apply)

      + admin_ssh_key {
          + public_key = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDBx48SGUdo6lra3pNytbYZUHaGbOk8ZIz6DLY8YkGsSsiI/i2S2F+D9geT+N5FCM/1KNhxnPXW/garkf3fjmsIzHnj+5K7CdGzOxNXRWySxAZ1DpcH74iAclUwcDwj/OYh+cpWkNPCZmjb0N2sLp9FFpJjhZGQmMU5KBDGN52BwyWMN5ES54+2/ZlxuqAW8EN+83XJ7f12m2yPxIQw1XE3GDzlNEoBLxbGEjq1ZEYL8XE5AcQaML9FjZyr5XM9k3QqdkedOFcdLEXRW+dZwxjfn6CIN9lH+hutnQL/kPfZ8H8GdwKCR271ed6BAXqece0g8qEageeWIq2s0IFSSRe5r5RUbUuEcfJKKwwuSVBwDyVSi4uky1KVaMHK5IXL0IgPRNOAblDBYncTPlqxWKp4UwWbPyz1ElF2R5GA5H4vwLdsIIACk6wbhPUFJyFtt+tKAM79YeySk1GlcKcFIAN8QEL+94GNtC4NNA/UD28WoddnHZ8FsV82r+5TDicHPulF7PZ67386kDvZpReZi9M1diR4B5LM7IPPFNZa0TISxgOcz783EFcUm6zoLajLqEMUr9rPVhjbzANJ0R9ohKHy97SPcaC9x9XJPK/hFn9FRTL8RHx7EfXgQR4D3+Ww9HHeqBMcJKFmBhjn7Rkj0niEfaPcppG9ULg9LoTvvLtN+w== vinz@Vinz-Laptop
            EOT
          + username   = "adminuser"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }
    }

  # module.vm1.azurerm_virtual_machine_extension.installvault will be created
  + resource "azurerm_virtual_machine_extension" "installvault" {
      + id                   = (known after apply)
      + name                 = "installvault"
      + protected_settings   = (sensitive value)
      + publisher            = "Microsoft.Azure.Extensions"
      + tags                 = {
          + "Terraform" = "true"
        }
      + type                 = "CustomScript"
      + type_handler_version = "2.0"
      + virtual_machine_id   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @neolutin, Action: `pull_request`*